src/Documents/ЗаявкаФСВТС/ЗаявкаФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаФСВТС</name>
  <registerRecords>AccumulationRegister.ЗаявкиФСВТС</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодачиТКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проекты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Корабли</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.Заказы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>КодПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ЗаявкиФСВТС/ЗаявкиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаявкиФСВТС</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ЗаявкаФСВТС/ObjectModule.bsl
///////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЕстьОшибки()
	Результат = Ложь;
	
	// Проверка на вхождение изделия в корабли
	МассивКораблей = Корабли.ВыгрузитьКолонку("Корабль");
	Для Сч = 0 По ПредметыСнабжения.Количество() - 1 Цикл
		Строка = ПредметыСнабжения[Сч];
		Если МассивКораблей.Найти(Строка.Изделие.Владелец) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка №" 	+ (Сч + 1) 
																			+ ". Изделие принадлежит кораблю, не указанному в списке кораблей",,
																			"Объект.ПредметыСнабжения[" + Сч + "].Изделие");
			Результат = Истина;
		КонецЕсли; // Если МассивКораблей.Найти(Строка.Изделие.Владелец) = Неопределено Тогда		
	КонецЦикла; // Для Сч = 0 По ПредметыСнабжения.Количество() - 1 Цикл
	
	Возврат Результат;
КонецФункции // ЕстьОшибки

///////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьПроекты() Экспорт
	МассивПроектов 	= Новый Массив;
	Для Каждого Строка Из Корабли Цикл
		Проект 	= Строка.Корабль.Владелец;
		Если МассивПроектов.Найти(Проект) = Неопределено Тогда
			МассивПроектов.Добавить(Проект);
		КонецЕсли; // Если Проекты.Найти(Строка.Корабль.Владелец) = Неопределено Тогда		
	КонецЦикла; // Для Каждого Строка Из Корабли Цикл	
	Возврат МассивПроектов;
КонецФункции // ПолучитьПроекты

Процедура ЗаполнитьНеидентифицированныеПредметыСнабжения() Экспорт
	Для Каждого Строка Из ПредметыСнабжения Цикл
		Если ЗначениеЗаполнено(Строка.ПредметСнабжения) Тогда
			Продолжить;
		КонецЕсли; // Если ЗначениеЗаполнено(Строка.ПредметСнабжения) Тогда
		
		НеидентицифированныйПС = Справочники.НеиденитифицированныеПредметыСнабжения.НайтиПоОбозначению(Строка.ОбозначениеПС);
		Если НеидентицифированныйПС = Неопределено Тогда
			НеидентицифированныйПС = Справочники.НеиденитифицированныеПредметыСнабжения.Создать(Строка.НаименованиеПС, Строка.ОбозначениеПС);
		КонецЕсли; // Если НеидентицифированныйПС = Неопределено Тогда
		
		Строка.ПредметСнабжения = НеидентицифированныйПС;
	КонецЦикла; // Для Каждого Строка Из ПредметыСнабжения Цикл	
КонецПроцедуры // ЗаполнитьНеидентифицированныеПредметыСнабжения

///////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Если ЕстьОшибки() Тогда
	//	Отказ = Истина;
	//	Возврат
	//КонецЕсли; // Если ЕстьОшибки() Тогда
	
	// РН ЗаявкиФСВТС
	ТаблицаДвижений = Документы.ЗаявкаФСВТС.СформироватьТаблицуДвиженийЗаявкиФСВТС(Ссылка);
	Движения.ЗаявкиФСВТС.Загрузить(ТаблицаДвижений);
КонецПроцедуры // ОбработкаПроведения

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	МассивПроектов 					= ПолучитьПроекты();
	Если МассивПроектов.Количество() > 0 Тогда
		Проекты = СтрСоединить(МассивПроектов, ", ");
	КонецЕсли; // Если МассивПроектов.Количество() > 0 Тогда	
КонецПроцедуры // ПередЗаписью
